### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
!       handler                        = "main.handler" -> "app.main.handler"
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-18T00:47:53.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:38",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:32" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:32/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip" -> "lambda-builds/6772f443cca1fed8e68b2590f3b13fd9b21acc180434881f755328454a774975.zip"
!       s3_object_version              = "BumeXm5AIYah4NayLu6eFB9NZWl2OJih" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "32" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "32" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "2e230355c7727d975ab8e87c3c471997" -> (known after apply)
!       id                     = "lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip" -> (known after apply)
!       key                    = "lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip" -> "lambda-builds/6772f443cca1fed8e68b2590f3b13fd9b21acc180434881f755328454a774975.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip" -> "./.terraform/lambda-builds/6772f443cca1fed8e68b2590f3b13fd9b21acc180434881f755328454a774975.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "BumeXm5AIYah4NayLu6eFB9NZWl2OJih" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!app/.*",
                        ],
                    ],
+                   [
+                       "zip:embedded",
+                       ".",
+                       "app/",
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/6772f443cca1fed8e68b2590f3b13fd9b21acc180434881f755328454a774975.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/6772f443cca1fed8e68b2590f3b13fd9b21acc180434881f755328454a774975.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7099693818872567685" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip" -> "./.terraform/lambda-builds/6772f443cca1fed8e68b2590f3b13fd9b21acc180434881f755328454a774975.zip"
!           "timestamp" = "1692304386996400200" -> "1692325087725211000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "793985156165348936" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip" -> "./.terraform/lambda-builds/6772f443cca1fed8e68b2590f3b13fd9b21acc180434881f755328454a774975.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
+                       commands = [
+                           ":zip . app/",
                        ]
!                       path     = "./app" -> "."
!                       patterns = <<-EOT
                            !app/.*
                        EOT -> [
+                           "!app/.*",
                        ]
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:38" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-17T20:34:14.903+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:38" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/f34436fc398b538cd80ac1f22968cc0ec3a674785188b3f9d18f31fc7384576f.zip" -> "builds/dc7fe2c92e7d0f3e06ec24c474e1f719aa0613e578fd73c716b08b3a33c9b06d.zip"
!       s3_object_version           = ".uQJtiYb7o565lGyymM4iwlg2AIvPOnX" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "qkJ1EnGqvPJ0drD/1b/OlKYuUlp3URCPttTWdjYFKJI=" -> (known after apply)
!       source_code_size            = 29717616 -> (known after apply)
!       version                     = "38" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "ad5e27c4df0a222ec3c752a2e1431e6f-6" -> (known after apply)
!       id                     = "builds/f34436fc398b538cd80ac1f22968cc0ec3a674785188b3f9d18f31fc7384576f.zip" -> (known after apply)
!       key                    = "builds/f34436fc398b538cd80ac1f22968cc0ec3a674785188b3f9d18f31fc7384576f.zip" -> "builds/dc7fe2c92e7d0f3e06ec24c474e1f719aa0613e578fd73c716b08b3a33c9b06d.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/f34436fc398b538cd80ac1f22968cc0ec3a674785188b3f9d18f31fc7384576f.zip" -> "builds/dc7fe2c92e7d0f3e06ec24c474e1f719aa0613e578fd73c716b08b3a33c9b06d.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = ".uQJtiYb7o565lGyymM4iwlg2AIvPOnX" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/dc7fe2c92e7d0f3e06ec24c474e1f719aa0613e578fd73c716b08b3a33c9b06d.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/dc7fe2c92e7d0f3e06ec24c474e1f719aa0613e578fd73c716b08b3a33c9b06d.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7651031407793923349" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/f34436fc398b538cd80ac1f22968cc0ec3a674785188b3f9d18f31fc7384576f.zip" -> "builds/dc7fe2c92e7d0f3e06ec24c474e1f719aa0613e578fd73c716b08b3a33c9b06d.zip"
!           "timestamp" = "1692304388810374000" -> "1692325086572706000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "332217124311925875" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/f34436fc398b538cd80ac1f22968cc0ec3a674785188b3f9d18f31fc7384576f.zip" -> "builds/dc7fe2c92e7d0f3e06ec24c474e1f719aa0613e578fd73c716b08b3a33c9b06d.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>